    // Array of text content for the divs
    const textsArray1 = [
        "اللهم إني أَسْأَلُكَ العَفْوَ والعَافِيَةَ في الدُّنْيا والآخِرَةِ",
        "اللهم ارزُقْنِي رِزْقًا حَلالًا طَيِّبًا وَاسِعًا مُبارَكًا فِيهِ",
        "اللهم اغْفِرْ لِي ذَنْبِي، وَوَسِّعْ لِي في دَارِي، وَبارِكْ لِي في رِزْقِي",
        "اللهم ارزُقْنِي رِزْقًا حَلالًا طَيِّبًا وَاسِعًا مُبارَكًا فِيهِ",
        "اللهم اجْعَلْنِي مِنَ التَّوابِينَ وَاجْعَلْنِي مِنَ المُتَطَهِّرِينَ",
        "اللهم اهدِنِي وَسَدِّدْنِي وَاجْعَلْنِي سَبَبًا لِمَنِ اهْتَدَى",
        "اللهم إني أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلاءِ وَدَرَكَ الشَّقاءِ وَسُوءِ الْقَضاءِ",
        "اللهم إني أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ",
        "اللهم يا مُقَلِّبَ الْقُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِينِكَ",
        "اللهم ارزُقْنِي حُسْنَ الْخَاتِمَةِ وَاغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُسْلِمِينَ أَجْمَعِينَ"
    ];
    




    const textsArray2  =  [
        "أذكار الصباح أعوذ بالله من الشيطان الرجيم اللّهُ لا إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. (البقرة: 255) بسم الله الرحمن الرحيم قُلْ هُوَ اللَّهُ أَحَدٌ ٭ اللَّهُ الصَّمَدُ ٭ لَمْ يَلِدْ وَلَمْ يُولَدْ ٭ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ. (ثلاث مرات) قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ٭ مِن شَرِّ مَا خَلَقَ ٭ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٭ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ٭ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. (ثلاث مرات) قُلْ أَعُوذُ بِرَبِّ النَّاسِ ٭ مَلِكِ النَّاسِ ٭ إِلَهِ النَّاسِ ٭ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ٭ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ٭ مِنَ الْجِنَّةِ وَالنَّاسِ. (ثلاث مرات) أصبحنا وأصبح الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده، وأعوذ بك من شر ما في هذا اليوم وشر ما بعده، ربِّ أعوذ بك من الكسل وسوء الكبر، ربِّ أعوذ بك من عذاب في النار وعذاب في القبر. (مرة واحدة) اللهم بك أصبحنا وبك أمسينا، وبك نحيا وبك نموت وإليك النشور. (مرة واحدة)",
        "أذكار المساء أعوذ بالله من الشيطان الرجيم اللّهُ لا إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لا تَأْخُذُهُ سِنَةٌ وَلا نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. (البقرة: 255) بسم الله الرحمن الرحيم قُلْ هُوَ اللَّهُ أَحَدٌ ٭ اللَّهُ الصَّمَدُ ٭ لَمْ يَلِدْ وَلَمْ يُولَدْ ٭ وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ. (ثلاث مرات) قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ٭ مِن شَرِّ مَا خَلَقَ ٭ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ٭ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ٭ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. (ثلاث مرات) قُلْ أَعُوذُ بِرَبِّ النَّاسِ ٭ مَلِكِ النَّاسِ ٭ إِلَهِ النَّاسِ ٭ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ ٭ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ٭ مِنَ الْجِنَّةِ وَالنَّاسِ. (ثلاث مرات) أمسينا وأمسى الملك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذه الليلة وخير ما بعدها، وأعوذ بك من شر ما في هذه الليلة وشر ما بعدها، ربِّ أعوذ بك من الكسل وسوء الكبر، ربِّ أعوذ بك من عذاب في النار وعذاب في القبر. (مرة واحدة) اللهم بك أمسينا وبك أصبحنا، وبك نحيا وبك نموت وإليك المصير. (مرة واحدة)",
        "أستغفر الله، أستغفر الله، أستغفر الله دعاء التوبة اللهم أنت السلام ومنك السلام تباركت يا ذا الجلال والإكرام آية الكرسي اللَّهُ لا إِلٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ... (البقرة: 255) التسبيح والتحميد والتكبير سبحان الله (33 مرة) الحمد لله (33 مرة) الله أكبر (33 مرة) ثم يتمم المئة بقول: لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير دعاء شامل اللهم لا مانع لما أعطيت ولا معطي لما منعت ولا ينفع ذا الجد منك الجد دعاء لطلب المغفرة اللهم أعني على ذكرك وشكرك وحسن عبادتك هذه الأذكار من السنن المستحبة بعد كل صلاة، ومن الأفضل المواظبة عليها لتنال الأجر والثواب."
    ];













